package com.example.ashaapp.utils

class Incentives {
    val schemesMap = hashMapOf<String, ArrayList<Map<String, Any>>>(
        "RCH.1.3.5" to arrayListOf(
            hashMapOf(
                "name" to "શહેરી વિસ્તાર:JSYના હેઠળની સગર્ભાને સંપુર્ણ પુર્વ પ્રસુતિ સેવાઓ(ANC) સેવાઓ અપાવવા, લાભાર્થીનું આધાર લીંકડ બેંક એકાઉન્ટ ખોલાવવા માટે (અર્બન માટે અર્બન ની ગાઈડલાઈન મુજબ ચુકવવાનાં રેહશે)",
                "value" to 200
            ),
            hashMapOf(
                "name" to "શહેરી વિસ્તારની JSYના સગર્ભાની રાજય સરકારની આરોગ્ય સંસ્થા તથા ગ્રાન્ટ ઇન એઇડ સંસ્થામાં તેની પ્રસુતિ થાય તે માટે",
                "value" to 200
            ),
        ),
        "RCH.7.1.11" to arrayListOf(
            hashMapOf(
                "name" to "પ્રજનન વયની મહિલાઓ (બિન સગર્ભા અને સ્તનપાન કરાવતી સ્ત્રીઓ ૨૦ થી ૪૯ વર્ષ)ને એકત્રિત કરી આયર્નની ગોળી ખવડાવવા માટે",
                "value" to 50
            ),
        ),
        "RCH.7.1.12" to arrayListOf(
            hashMapOf(
                "name" to "રાષ્ટ્રીય આયર્ન પ્લસ ઇનિઇશિએટિવ પ્રોગ્રામ અંતગર્ત ૦૬-૫૯ માસના બાળકોનુ મોબીલાઈઝેસન કરી આયર્નની સિરપ આપવા માટે",
                "value" to 100
            ),
        ),
        "RCH.7.5.2" to arrayListOf(
            hashMapOf(
                "name" to "માં પ્રોગ્રામ અંતર્ગત આશાને પ્રતિ ક્વાર્ટર માતાને સ્તનપાન વિશે સમજ આપવા અને કાઉન્સલીંગ માટે મીટીંગમાં બોલાવવા માટે",
                "value" to 100
            ),
        ),
        "RCH.3.3.4" to arrayListOf(
            hashMapOf(
                "name" to "નવજાત શીશુની ઘરે સંભાળ (HBNC) માટેનું ઇન્સેન્ટીવ (આશા ઓછામાં ઓચીન ૩ મુલાકત લે તો તેને રૂ.૧૨૫/- અને ઓછામાં ઓછી ૫ કે તેથી વધારે મુલાકાત માટે રૂ.૨૫૦/-ઇન્સેન્ટીવ મળવાપાત્ર છે.)  ૩ થી ઓછી મુલાકાત માટે આશાને ઇન્સેન્ટીવ મળવાપાત્ર નથી",
                "value" to 250
            ),
        ),
        "RCH.7.3.3" to arrayListOf(
            hashMapOf(
                "name" to "કુપોષિત બાળકો તેમજ (CMTCs/NRCs માંથી ડીસચાર્જ થયેલા SAM) બાળકોના ત્રણ ફોલોઅપનાં ભાગરૂપે રૂ.૧૫૦ આશાને ઇન્સેન્ટીવ",
                "value" to 150
            ),
        ),
        "RCH.7.2.7" to arrayListOf(
            hashMapOf(
                "name" to "કૃમિનાશક દિવસ અંતર્ગત આશાને ૧ થી ૧૯ વર્ષના શાળાએ ન જતા બાળકોને એકત્ર કરી કૃમિનાશક દવા આપવા માટે રૂ. ૧૦૦/-",
                "value" to 100
            ),
        ),
        "RCH.7.7.6" to arrayListOf(
            hashMapOf(
                "name" to "ઝાડા નિયંત્રણ પખવાડીયા દરમ્યાન પાંચ વર્ષથી ઓછી વયના બાળકોવાળા  કુટૂંબોમાં ઓ.આર.એસ. પેકેટની વહેચણી",
                "value" to 100
            ),
        ),
        "RCH.3.3.5" to arrayListOf(
            hashMapOf(
                "name" to "એચ.બી.વાય.સી. (૨ થી ૩ મહિના પછી ત્રિમાસિક ગૃહ મુલાકાત (ત્રીજા, છઠ્ઠા, નવમા, બારમા અને પંદર મહિના) કરવાની રહેશે",
                "value" to 50
            ),
        ),
        "RCH.4.1.9" to arrayListOf(
            hashMapOf(
                "name" to "૧ વર્ષની ઉંમર સુધીના બાળકના સંપુ્ણ રસીકરણ માટે રૂ.૧૦૦/-(BCG, OPV-1,2,3, પેન્ટાવેલેન્ટ -૧,૨,૩, મીઝલ્સ/MR-૧, FIPV)",
                "value" to 100
            ),
            hashMapOf(
                "name" to "લાભાર્થીના સંપુર્ણ રસીકરણ માટે રૂ.૭૫ પ્રતિ લાભાર્થી",
                "value" to 75
            ),
            hashMapOf(
                "name" to "૫ થી ૬ વર્ષ ના લાભાર્થીના ડી.પી.ટી. બુસ્ટર ડોઝ માટે",
                "value" to 50
            ),
        ),
        "RCH.4.1.10" to arrayListOf(
            hashMapOf(
                "name" to "બાળકોના મોબીલાઇઝીંગ માટે આશા ઇન્સેન્ટીવ",
                "value" to 150
            ),
        ),
        "RCH.6.3.15" to arrayListOf(
            hashMapOf(
                "name" to "સર્વિસ પ્રોવાઇડર દ્વારા સરકારી સંસ્થા /સરકાર માન્ય કુટુંબ કલ્યાણ કેંદ્ર /GIA માં PPIUCD મૂકાવ્યાની ખાતરી કર્યા બાદ ",
                "value" to 150
            ),
        ),
        "3.1.1.1.4.5" to arrayListOf(
            hashMapOf(
                "name" to "સર્વિસ પ્રોવાઇડર દ્વારા સરકારી સંસ્થા /સરકાર માન્ય કુટુંબ કલ્યાણ કેંદ્ર /GIA માં PAIUCD મૂકાવ્યાની ખાતરી કર્યા",
                "value" to 150
            ),
        ),
        "RCH.6.9.11" to arrayListOf(
            hashMapOf(
                "name" to "૨ બાળક વચ્ચે ૩વર્ષ નો સમયગાળો અને લગ્ન પછી ૨ વર્ષનો સમયગાળની ખાત્રી કરવાની આશાને પ્રોત્સાહનની રકમ",
                "value" to 500
            ),
        ),
        "RCH.6.9.12" to arrayListOf(
            hashMapOf(
                "name" to "બે બાળક સુધી કુટુંબ કલ્યાણ કાયમી પધ્ધતિ અપનાવવા માટે પ્રોત્સાહન બદલ પ્રતિ કેસ રૂ.૧૦૦૦/-",
                "value" to 1000
            ),
        ),
        "RCH.6.4.6" to arrayListOf(
            hashMapOf(
                "name" to "સર્વિસ પ્રોવાઇડર દ્વારા સરકારી સંસ્થા /સરકાર માન્ય કુટુંબ કલ્યાણ કેંદ્ર /GIA માં અંતરા મૂકાવ્યાની ખાતરી કર્યા બાદ પ્રા.આ.કેંદ્ર દ્વારા આશાને પ્રતિ કેસ દીઠ રૂ.૧૦૦/- ઇન્સેન્ટીવ ચૂકવવું",
                "value" to 100
            ),
        ),
        "RCH.6.10.4" to arrayListOf(
            hashMapOf(
                "name" to "નયી પહેલ કિટ વિતરણ માટે",
                "value" to 100
            ),
        ),
        "RCH.1.2.6" to arrayListOf(
            hashMapOf(
                "name" to "જોખમી લક્ષણો ધરાવતી સગર્ભામાતાઓને જાહેર આરોગ્ય સંસ્થા સુધી લઈ જવા માટે આશા બહેનને પ્રોત્સાહક રકમ (કુલ બે વિઝીટ સુધી જ મળવાપાત્ર છે.)",
                "value" to 200
            ),
        ),
    )
}